УТ_для_edt/src/DataProcessors/смартПечатьСопроводительныхДокументов/смартПечатьСопроводительныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>смартПечатьСопроводительныхДокументов</name>
  <comment>// смарт:ММ #044 224 137 27.04.2020</comment>
  <attributes>
    <name>НомерОтправления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправления</name>
    <comment>#4418 смарт: Тимофеева 26.09.2025 / Обработка Печать Сопроводительных Документов. Доработка.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменаЧего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <comment>// 27.08.2020</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицоСПравомПодписи</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапчастиКОтправке</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>CatalogRef.КлассификаторТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаявки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаСсылка</name>
      <comment>//смарт:ММ 635 19.10.2021</comment>
      <type>
        <types>DocumentRef.смартЗаявкаНаГарантийныйРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерОтправления</name>
      <comment>#4418 смарт: Тимофеева 26.09.2025 / Обработка Печать Сопроводительных Документов. Доработка.</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтправления</name>
      <comment>#4418 смарт: Тимофеева 26.09.2025 / Обработка Печать Сопроводительных Документов. Доработка.</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ_для_edt/src/InformationRegisters/смартОписанияДляПретензий/смартОписанияДляПретензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартОписанияДляПретензий</name>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартСтатусыПоГарантии/смартСтатусыПоГарантии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыПоГарантии</name>
  <comment>//смарт:ММ #001 137</comment>
  <enumValues>
    <name>ОжидаютсяДействия</name>
  </enumValues>
  <enumValues>
    <name>ОтправленоПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаНеТребуется</name>
  </enumValues>
  <enumValues>
    <name>ВГарантииОтказано</name>
  </enumValues>
  <enumValues>
    <name>НечемЗаменить</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяОтправка</name>
  </enumValues>
  <enumValues>
    <name>ДоставленоПоставщику</name>
    <comment>// 28.06.2020</comment>
  </enumValues>
  <enumValues>
    <name>ПоставщикПодтвердилПолучение</name>
    <comment>// 28.06.2020</comment>
  </enumValues>
  <enumValues>
    <name>Списано</name>
    <comment>// 20.07.2020</comment>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
    <comment>// 20.07.2020</comment>
  </enumValues>
  <enumValues>
    <name>ОплаченоКлиентомИнженером</name>
    <comment>//29.08.2020</comment>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаНеТребуетсяНедовложение</name>
    <comment>// 13.12.2020</comment>
  </enumValues>
  <enumValues>
    <name>ПеремещеноДляРемонта</name>
    <comment>#Б2434 смарт: Шляпников 04.03.2025 / Заявка на гарантийный ремонт. Дополнительные статусы.</comment>
  </enumValues>
  <enumValues>
    <name>ПеремещеноНаФСО</name>
    <comment>//++ #Б-5952 смарт: Фролов 11.03.2026 //Доработка гарантийной заявки. Новый статус</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/DataProcessors/смартПечатьСопроводительныхДокументов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СуммаДляВыделенияКрасным = 199;
	Объект.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.НайтиПоНаименованию("СМАРТ-Т Совкомбанк (РУБ) - 177", Истина);
	Объект.Дата = ТекущаяДата();
	Объект.ЗаменаЧего = "запасные части печатного оборудования"; // или "чернила"
	Объект.Валюта = Справочники.Валюты.НайтиПоКоду("840");
	
	// 27.08.2020
	// ++ 27.11.2002
    //Объект.Оператор = "TNT";
    Объект.Оператор = "DHL";
    
	//++ #Б-3706 смарт: Лопато 07.07.2025 //Печать сопроводительных документов (смарт). Подпись.
	НаименованиеОтвЛица = "Акимов Ф";

	ОтборОтвЛиц = Новый Структура;
	ОтборОтвЛиц.Вставить("Дата", 			  ТекущаяДата());
	ОтборОтвЛиц.Вставить("Организация", 	  Объект.БанковскийСчет.Владелец);
	ОтборОтвЛиц.Вставить("ОтветственноеЛицо", Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);

	ТЗОтветственныхЛиц = ОтветственныеЛицаСервер.ПолучитьТаблицуОтветственныхЛицПоОтбору(ОтборОтвЛиц);	
	ТЗОтветственныхЛиц.Сортировать("Наименование");
	
	Элементы.ЛицоСПравомПодписи.СписокВыбора.ЗагрузитьЗначения(ТЗОтветственныхЛиц.ВыгрузитьКолонку("Ссылка"));
	
	Для Каждого СтрОтвЛицо Из ТЗОтветственныхЛиц Цикл

		Если СтрНайти(СокрЛП(СтрОтвЛицо.Ссылка), НаименованиеОтвЛица) <> 0 Тогда 
			Объект.ЛицоСПравомПодписи = СтрОтвЛицо.Ссылка;
		КонецЕсли;	
			
	КонецЦикла;	
	//-- #Б-3706 смарт: Лопато 07.07.2025
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийИЭлементовФормы

&НаКлиенте
Процедура НомерОтправленияПриИзменении(Элемент)
	
	Если Объект.ЗапчастиКОтправке.Количество() = 0 Тогда
		//ЗаполнитьНаСервере();
	КонецЕсли;
	
	//++ #4418 смарт: Тимофеева 26.09.2025 / Обработка Печать Сопроводительных Документов. Доработка.
	Если Объект.ЗапчастиКОтправке.Количество() > 0 Тогда 
		Объект.ЗапчастиКОтправке.Очистить();
		ПоказатьПредупреждение(, "Для актуализации данных по заявкам необходимо нажать кнопку ""Заполнить""", 10);
	КонецЕсли; 
	//-- #4418 смарт: Тимофеева 26.09.2025
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтправленияПриИзменении(Элемент)
	//++ #4418 смарт: Тимофеева 26.09.2025 / Обработка Печать Сопроводительных Документов. Доработка.
	Если Объект.ЗапчастиКОтправке.Количество() > 0 Тогда 
		Объект.ЗапчастиКОтправке.Очистить();
		ПоказатьПредупреждение(, "Для актуализации данных по заявкам необходимо нажать кнопку ""Заполнить""", 10);
	КонецЕсли; 
	//-- #4418 смарт: Тимофеева 26.09.2025
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)	
	//++ #3978 смарт: Тимофеева 13.08.2025 / Печать сопроводительных документов. Замена печатных форм
	//ПересчитатьЦенуВТаблице();
	ПересчитатьЦеныВТаблице();
	//-- #3978 смарт: Тимофеева 13.08.2025
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	//++ #3978 смарт: Тимофеева 13.08.2025 / Печать сопроводительных документов. Замена печатных форм
	ПересчитатьЦеныВТаблице();
	//-- #3978 смарт: Тимофеева 13.08.2025	
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиКОтправкеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//++ #4418 смарт: Тимофеева 26.09.2025 / Обработка Печать Сопроводительных Документов. Доработка.
	Если Поле = Элементы.Найти("ЗапчастиКОтправкеНомерЗаявки") Тогда		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ЗначениеЗаполнено(ТекущиеДанные.ЗаявкаСсылка) Тогда
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение(, ТекущиеДанные.ЗаявкаСсылка);			
		КонецЕсли; 	
	КонецЕсли;
	//-- #4418 смарт: Тимофеева 26.09.2025
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапчастиКОтправке

&НаКлиенте
Процедура ЗапчастиКОтправкеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	РаскраситьЭлементы();
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиКОтправкеКоличествоПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиКОтправкеЦенаПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоЗаявкамНаРемонт(Команда)
	
	Если Объект.ЗапчастиКОтправке.Количество() > 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗаполнениемТабличнойЧастиЗавершение", ЭтотОбъект, );
		ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть будет очищена. Заполнить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
	Иначе
		ЗаполнитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОписанияДляПретензий(Команда)
	ОткрытьФорму("РегистрСведений.смартОписанияДляПретензий.ФормаСписка",, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	Если Объект.ЗапчастиКОтправке.Количество() = 0 Тогда
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не нажата кнопка Заполнить или по указанному номеру отправления нет данных!");
		//Возврат;
		ЗаполнитьНаСервере();
	КонецЕсли;
	
	//++ #3978 смарт: Тимофеева 08.08.2025 / Печать сопроводительных документов. Замена печатных форм
	//ПечатьИнвойсMimaki();
	//ПечатьПриложение1Mimaki();
	//ПечатьРекламационныйАктMimaki();
	ПечатьИнвойс();
	ПечатьУпаковочныйЛист();
	ПечатьРекламационныйАкт();
	//-- #3978 смарт: Тимофеева 08.08.2025	
	
	//++ #Б-5960 смарт: Фролов 06.03.2026 //Печать сопроводительных документов. Новый бланк
	ПечатьБланкПередачиБрака();
	//-- #Б-5690 смарт: Фролов 06.03.2026
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПрочиеПроцедурыИФункции

&НаКлиенте
Процедура ВопросПередЗаполнениемТабличнойЧастиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда	
		
		ЗаполнитьНаСервере();		
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	Об.ЗаполнитьТаблицу();
	ЗначениеВРеквизитФормы(Об, "Объект");
	
	Если Объект.ЗапчастиКОтправке.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По номеру отправления " + Объект.НомерОтправления + " не найдено запчастей к отправке");
	КонецЕсли;
	
	РаскраситьЭлементы();
		
КонецПроцедуры

&НаСервере
Процедура РаскраситьЭлементы()
	
	Если Объект.ЗапчастиКОтправке.Итог("Сумма") > СуммаДляВыделенияКрасным Тогда
		Элементы.ЗапчастиКОтправкеСумма.ЦветФонаПодвала = WebЦвета.Красный	
	Иначе
		Элементы.ЗапчастиКОтправкеСумма.ЦветФонаПодвала = Новый Цвет;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте 
Процедура ПересчитатьСумму()
	
	ТекущиеДанные = Элементы.ЗапчастиКОтправке.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПересчитатьЦенуВТаблице()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЗ.НомерСтроки КАК НомерСтроки,
	|	ТЗ.Номенклатура КАК Номенклатура,
	|	ТЗ.Количество КАК Количество,
	|	ТЗ.КодТНВЭД КАК КодТНВЭД,
	|	ТЗ.ВесНетто КАК ВесНетто,
	|	ТЗ.Описание КАК Описание,
	|	ТЗ.НомерЗаявки КАК НомерЗаявки
	|ПОМЕСТИТЬ ВТ_ТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ТЗ.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТЗ.Номенклатура КАК Номенклатура,
	|	ВТ_ТЗ.Количество КАК Количество,
	|	ВТ_ТЗ.КодТНВЭД КАК КодТНВЭД,
	|	ВТ_ТЗ.ВесНетто КАК ВесНетто,
	|	ВТ_ТЗ.Описание КАК Описание,
	|	ВТ_ТЗ.НомерЗаявки КАК НомерЗаявки,
	|	ЕСТЬNULL(смартОписанияДляПретензий.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) КАК Курс,
	|	ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 1) КАК Кратность,
	|	ЕСТЬNULL(КурсыВалютСрезПоследнихДоллар.Курс, 1) КАК КурсДоллар,
	|	ЕСТЬNULL(КурсыВалютСрезПоследнихДоллар.Кратность, 1) КАК КратностьДоллар
	|ИЗ
	|	ВТ_ТЗ КАК ВТ_ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартОписанияДляПретензий КАК смартОписанияДляПретензий
	|		ПО ВТ_ТЗ.Номенклатура = смартОписанияДляПретензий.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалютСрезПоследних
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &ВалютаДоллар) КАК КурсыВалютСрезПоследнихДоллар
	|		ПО (ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ТЗ", Объект.ЗапчастиКОтправке.Выгрузить());
		
	ВалютаДоллар = Справочники.Валюты.НайтиПоКоду("840");
	
	Запрос.УстановитьПараметр("ВалютаДоллар", ВалютаДоллар);
	Запрос.УстановитьПараметр("Валюта", Объект.Валюта);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Объект.ЗапчастиКОтправке.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Объект.ЗапчастиКОтправке.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		ПараметрыВалютыДок = Новый Структура("Валюта, Курс, Кратность", Объект.Валюта, Выборка.Курс, Выборка.Кратность);
		ПараметрыВалютыВР  = Новый Структура("Валюта, Курс, Кратность", ВалютаДоллар, Выборка.КурсДоллар,  Выборка.КратностьДоллар);
		
		НоваяСтрока.Цена = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(НоваяСтрока.Цена, ПараметрыВалютыВР, ПараметрыВалютыДок);
		НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Печать

&НаКлиенте
Процедура ПечатьДокументов(КоллекцияПечатныхФорм, Знач ОбъектыПечати = Неопределено, ВладелецФормы = Неопределено, ЗаголовокФормы = "")
	Если ОбъектыПечати = Неопределено Тогда
		ОбъектыПечати = Новый СписокЗначений;
	КонецЕсли;
	
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	
	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	ПараметрыОткрытия.ПараметрыПечати = Новый Структура("ЗаголовокФормы", ЗаголовокФормы);
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);
	ПараметрыОткрытия.Вставить("ОбъектыПечати", ОбъектыПечати);
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, КлючУникальности);
КонецПроцедуры


&НаКлиенте
Процедура ПечатьИнвойсMimaki()
	
	ТабличныйДокумент = СформироватьТабличныйДокументИнвойсMimakiНаСервере();
	
	Если Объект.ЗаменаЧего = "чернила" Тогда
		СинонимМакета = "Инвойс " + Формат(Объект.Дата, "ДФ=yyyy-MM-dd") + "_Ink";
	Иначе
		СинонимМакета = "Инвойс";
	КонецЕсли;
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ИнвойсMimaki");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].Экземпляров = 5;
    КоллекцияПечатныхФорм[0].СинонимМакета = СинонимМакета;
	КоллекцияПечатныхФорм[0].ИмяФайлаПечатнойФормы = СинонимМакета;
	
	ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма, СинонимМакета);

КонецПроцедуры


&НаСервере
Функция СформироватьТабличныйДокументИнвойсMimakiНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	ТабДок = Об.СформироватьТабличныйДокументИнвойсMimaki();
	ЗначениеВРеквизитФормы(Об, "Объект");
		
	Возврат ТабДок;

КонецФункции

&НаКлиенте
Процедура ПечатьПриложение1Mimaki()
	
	ТабличныйДокумент = СформироватьТабличныйДокументПриложениеMimakiНаСервере();
	
	Если Объект.ЗаменаЧего = "чернила" Тогда
		СинонимМакета = "Приложение 1 " + Формат(Объект.Дата, "ДФ=yyyy-MM-dd") + "_Ink";
	Иначе
		СинонимМакета = "Приложение 1";
	КонецЕсли;

	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Приложение1Mimaki");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].Экземпляров = 5;
    КоллекцияПечатныхФорм[0].СинонимМакета = СинонимМакета;
	
	ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма, СинонимМакета);

КонецПроцедуры

&НаСервере
Функция СформироватьТабличныйДокументПриложениеMimakiНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	ТабДок = Об.СформироватьТабличныйДокументПриложениеMimaki();
	ЗначениеВРеквизитФормы(Об, "Объект");
		
	Возврат ТабДок;

КонецФункции

&НаКлиенте
Процедура ПечатьРекламационныйАктMimaki()
	
	ТабличныйДокумент = СформироватьТабличныйДокументРекламационныйАктMimakiНаСервере();
	
	Если Объект.ЗаменаЧего = "чернила" Тогда
		СинонимМакета = "Рекламационный акт " + Формат(Объект.Дата, "ДФ=yyyy-MM-dd") + "_Ink";
	Иначе
		СинонимМакета = "Рекламационный акт";
	КонецЕсли;
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("РекламационныйАктMimaki");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].Экземпляров = 4;
    КоллекцияПечатныхФорм[0].СинонимМакета = СинонимМакета;
	
	ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма, СинонимМакета);

КонецПроцедуры

&НаСервере
Функция СформироватьТабличныйДокументРекламационныйАктMimakiНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	ТабДок = Об.СформироватьТабличныйДокументРекламационныйАктMimaki();
	ЗначениеВРеквизитФормы(Об, "Объект");
	
	Возврат ТабДок;

КонецФункции

//++ смарт:ММ 635 19.10.2021 
&НаКлиенте
Процедура ЗаполнитьВЗаявкахНомерОтправления(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЧтоЗаполняется", "НомерОтправления");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьВЗаявкахПолеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВводСтроки(ОписаниеОповещения, "", "Введите новый номер отправления", 30, Ложь);
		
КонецПроцедуры //-- смарт:ММ 19.10.2021

//++ смарт:ММ 635 19.10.2021 
&НаКлиенте
Процедура ЗаполнитьВЗаявкахДатуОтправления(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЧтоЗаполняется", "ДатаОтправления");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьВЗаявкахПолеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВводДаты(ОписаниеОповещения, , "Введите новую дату отправления", ЧастиДаты.Дата);

КонецПроцедуры //-- смарт:ММ 19.10.2021

//++ смарт:ММ 635 19.10.2021 
&НаКлиенте
Процедура ЗаполнитьВЗаявкахДатуДоставки(Команда)

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЧтоЗаполняется", "ДатаДоставки");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьВЗаявкахПолеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВводДаты(ОписаниеОповещения, , "Введите новую дату доставки", ЧастиДаты.Дата);
	
КонецПроцедуры //-- смарт:ММ 19.10.2021

//++ смарт:ММ 635 19.10.2021 
&НаКлиенте
Процедура ЗаполнитьВЗаявкахДатуПодтверждения(Команда)
		
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЧтоЗаполняется", "ДатаПодтверждения");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьВЗаявкахПолеЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВводДаты(ОписаниеОповещения, , "Введите новую дату подтверждения", ЧастиДаты.Дата);

КонецПроцедуры //-- смарт:ММ 19.10.2021

//++ смарт:ММ 635 19.10.2021 
&НаКлиенте
Процедура ЗаполнитьВЗаявкахПолеЗавершение(ВведенноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВведенноеЗначение <> Неопределено И ЗначениеЗаполнено(ВведенноеЗначение) Тогда
		ЧтоЗаполняется = ДополнительныеПараметры.ЧтоЗаполняется;
		ЗаменитьНомерОтправленияВЗаявках(ВведенноеЗначение, ЧтоЗаполняется);
	КонецЕсли;		
	
КонецПроцедуры //-- смарт:ММ 19.10.2021

//++ смарт:ММ 635 19.10.2021 
&НаСервере
Процедура ЗаменитьНомерОтправленияВЗаявках(НовоеЗначение, ИмяПоля)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.ЗаявкаСсылка КАК ЗаявкаСсылка,
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	ТЧ.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	&ТЧ КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЧ.ЗаявкаСсылка КАК ЗаявкаСсылка,
	|	ВТ_ТЧ.Номенклатура КАК Номенклатура,
	|	ВТ_ТЧ.Количество КАК Количество
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|ИТОГИ ПО
	|	ЗаявкаСсылка";
	
	Запрос.УстановитьПараметр("ТЧ", Объект.ЗапчастиКОтправке.Выгрузить());
	
	ВыборкаЗаявка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ИзмененоЗаписей = 0;

	СтатусДоставленоПоставщику = Неопределено;
	СтатусПоставщикПодтвердилПолучение = Неопределено;
	
	Если ИмяПоля = "ДатаДоставки" Тогда
		СтатусДоставленоПоставщику = Перечисления.смартСтатусыПоГарантии.ДоставленоПоставщику;
	КонецЕсли;
	
	Если ИмяПоля = "ДатаПодтверждения" Тогда
		СтатусПоставщикПодтвердилПолучение = Перечисления.смартСтатусыПоГарантии.ПоставщикПодтвердилПолучение;
	КонецЕсли;
	
	Пока ВыборкаЗаявка.Следующий() Цикл
		
		ЗаявкаОбъект = ВыборкаЗаявка.ЗаявкаСсылка.ПолучитьОбъект();
		БылиИзмененияВЗаявке = Ложь;
				
		Выборка = ВыборкаЗаявка.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Отбор = Новый Структура;
			
			Если ИмяПоля = "НомерОтправления" Тогда
				Отбор.Вставить("НомерОтправления", Объект.НомерОтправления);
			КонецЕсли;
			
			Отбор.Вставить("Номенклатура", Выборка.Номенклатура);
			
			НайденныеСтроки = ЗаявкаОбъект.ЗаполняетсяСпециалистомПоПретензиям.НайтиСтроки(Отбор);
			
			КоличествоКОтправке = Выборка.Количество;
			
			Для Каждого ТекСтрока Из НайденныеСтроки Цикл
				
				Если КоличествоКОтправке >= ТекСтрока.Количество Тогда
					
					КоличествоКОтправке = КоличествоКОтправке - ТекСтрока.Количество;
					
					Если ТекСтрока.НомерОтправления <> НовоеЗначение Тогда
						ТекСтрока[ИмяПоля] = НовоеЗначение;
						ИзмененоЗаписей = ИзмененоЗаписей + 1;
						БылиИзмененияВЗаявке = Истина;
						
						Если ИмяПоля = "ДатаДоставки" Тогда
							// Изменить статусы
							ТекСтрока.Статус = СтатусДоставленоПоставщику;
							
							НоваяСтрокаСтатус = ЗаявкаОбъект.Статусы.Добавить();							
							НоваяСтрокаСтатус.НомерПозиции = ТекСтрока.НомерПозиции;
							НоваяСтрокаСтатус.ДатаИзмененияСтатуса = ТекущаяДата();
							НоваяСтрокаСтатус.Статус = СтатусДоставленоПоставщику;
							
						ИначеЕсли ИмяПоля = "ДатаПодтверждения" Тогда
							// Изменить статусы
							ТекСтрока.Статус = СтатусПоставщикПодтвердилПолучение;
							
							НоваяСтрокаСтатус = ЗаявкаОбъект.Статусы.Добавить();							
							НоваяСтрокаСтатус.НомерПозиции = ТекСтрока.НомерПозиции;
							НоваяСтрокаСтатус.ДатаИзмененияСтатуса = ТекущаяДата();
							НоваяСтрокаСтатус.Статус = СтатусПоставщикПодтвердилПолучение;

						КонецЕсли;						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Если БылиИзмененияВЗаявке Тогда
			Попытка
				ЗаявкаОбъект.ОбменДанными.Загрузка = Истина;
				ЗаявкаОбъект.Записать();
			Исключение
				ТекстСообщения = "Не удалось изменить документ " + ВыборкаЗаявка.ЗаявкаСсылка + ": " + ОписаниеОшибки();
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецПопытки;			
		КонецЕсли;	
	КонецЦикла;
	
	ОбщегоНазначения.СообщитьПользователю("Изменено строк в документах: " + ИзмененоЗаписей);
	
КонецПроцедуры //-- смарт:ММ 19.10.2021

//++ #3978 смарт: Тимофеева 11.08.2025 / Печать сопроводительных документов. Замена печатных форм

&НаКлиенте
Процедура ПечатьРекламационныйАкт()
	
	ТабличныйДокумент = СформироватьТабличныйДокументРекламационныйАктНаСервере();
	
	Если Объект.ЗаменаЧего = "чернила" Тогда
		СинонимМакета = "Рекламационный акт " + Формат(Объект.Дата, "ДФ=yyyy-MM-dd") + "_Ink";
	Иначе
		СинонимМакета = "Рекламационный акт";
	КонецЕсли;
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ПФ_MXL_РекламационныйАкт");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].Экземпляров = 4;
    КоллекцияПечатныхФорм[0].СинонимМакета = СинонимМакета;
	
	ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма, СинонимМакета);

КонецПроцедуры

&НаСервере
Функция СформироватьТабличныйДокументРекламационныйАктНаСервере()	
	Об = РеквизитФормыВЗначение("Объект");
	ТабДок = Об.СформироватьТабличныйДокументРекламационныйАкт();
	ЗначениеВРеквизитФормы(Об, "Объект");
	
	Возврат ТабДок; 
КонецФункции

&НаКлиенте
Процедура ПечатьИнвойс()
	
	ТабличныйДокумент = СформироватьТабличныйДокументИнвойсНаСервере();
	
	Если Объект.ЗаменаЧего = "чернила" Тогда
		СинонимМакета = "Инвойс " + Формат(Объект.Дата, "ДФ=yyyy-MM-dd") + "_Ink";
	Иначе
		СинонимМакета = "Инвойс";
	КонецЕсли;
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ПФ_MXL_Инвойс");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].Экземпляров = 5;
    КоллекцияПечатныхФорм[0].СинонимМакета = СинонимМакета;
	КоллекцияПечатныхФорм[0].ИмяФайлаПечатнойФормы = СинонимМакета;
	
	ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма, СинонимМакета);

КонецПроцедуры

&НаСервере
Функция СформироватьТабличныйДокументИнвойсНаСервере()	
	Об = РеквизитФормыВЗначение("Объект");
	ТабДок = Об.СформироватьТабличныйДокументИнвойс();
	ЗначениеВРеквизитФормы(Об, "Объект");
		
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ПечатьУпаковочныйЛист()
	
	ТабличныйДокумент = СформироватьТабличныйДокументУпаковочныйЛистНаСервере();
	
	Если Объект.ЗаменаЧего = "чернила" Тогда
		СинонимМакета = "Упаковочный лист " + Формат(Объект.Дата, "ДФ=yyyy-MM-dd") + "_Ink";
	Иначе
		СинонимМакета = "Упаковочный лист";
	КонецЕсли;

	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ПФ_MXL_УпаковочныйЛист");    
    КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
    КоллекцияПечатныхФорм[0].Экземпляров = 5;
    КоллекцияПечатныхФорм[0].СинонимМакета = СинонимМакета;
	
	ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма, СинонимМакета);

КонецПроцедуры

&НаКлиенте
//++ #Б-5960 смарт: Фролов 06.03.2026 //Печать сопроводительных документов. Новый бланк
Процедура ПечатьБланкПередачиБрака()
	
	ТабличныйДокумент = СформироватьТабличныйДокументБланкПередачиБракаНаСервере();
	
	СинонимМакета = "Бланк передачи брака";

	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ПФ_MXL_БланкПередачиБрака");    
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабличныйДокумент; 
	КоллекцияПечатныхФорм[0].Экземпляров = 2;
	КоллекцияПечатныхФорм[0].СинонимМакета = СинонимМакета;
	
	ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено, ЭтаФорма, СинонимМакета);

КонецПроцедуры //-- #Б-5690 смарт: Фролов 06.03.2026

&НаСервере
//++ #Б-5960 смарт: Фролов 06.03.2026 //Печать сопроводительных документов. Новый бланк
Функция СформироватьТабличныйДокументБланкПередачиБракаНаСервере()	
	
	Об = РеквизитФормыВЗначение("Объект");
	ТабДок = Об.СформироватьТабличныйДокументБланкПередачиБрака();
	ЗначениеВРеквизитФормы(Об, "Объект");
		
	Возврат ТабДок;
	
КонецФункции //-- #Б-5690 смарт: Фролов 06.03.2026

&НаСервере
Функция СформироватьТабличныйДокументУпаковочныйЛистНаСервере()	
	Об = РеквизитФормыВЗначение("Объект");
	ТабДок = Об.СформироватьТабличныйДокументУпаковочныйЛист();
	ЗначениеВРеквизитФормы(Об, "Объект");
		
	Возврат ТабДок;
КонецФункции

&НаСервере
Процедура ПересчитатьЦеныВТаблице()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЗ.НомерСтроки КАК НомерСтроки,
	|	ТЗ.Номенклатура КАК Номенклатура,
	|	ТЗ.Количество КАК Количество,
	|	ТЗ.КодТНВЭД КАК КодТНВЭД,
	|	ТЗ.ВесНетто КАК ВесНетто,
	|	ТЗ.Описание КАК Описание,
	|	ТЗ.НомерЗаявки КАК НомерЗаявки,
	|	ТЗ.ЗаявкаСсылка КАК ЗаявкаСсылка
	//++ #4418 смарт: Тимофеева 26.09.2025 / Обработка Печать Сопроводительных Документов. Доработка.
	|   ,
	|	ТЗ.НомерОтправления КАК НомерОтправления,
	|	ТЗ.ДатаОтправления КАК ДатаОтправления
	//-- #4418 смарт: Тимофеева 26.09.2025
  	|ПОМЕСТИТЬ ВТ_ТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЗ.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТЗ.Номенклатура КАК Номенклатура,
	|	ВТ_ТЗ.Количество КАК Количество,
	|	ВТ_ТЗ.КодТНВЭД КАК КодТНВЭД,
	|	ВТ_ТЗ.ВесНетто КАК ВесНетто,
	|	ВТ_ТЗ.Описание КАК Описание,
	|	ВТ_ТЗ.НомерЗаявки КАК НомерЗаявки,
	|	ВТ_ТЗ.ЗаявкаСсылка КАК ЗаявкаСсылка,
	|	ЕСТЬNULL(смартОписанияДляПретензий.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(смартОписанияДляПретензий.Валюта, НЕОПРЕДЕЛЕНО) КАК Валюта
	//++ #4418 смарт: Тимофеева 26.09.2025 / Обработка Печать Сопроводительных Документов. Доработка.
	|   ,
	|	ВТ_ТЗ.НомерОтправления КАК НомерОтправления,
	|	ВТ_ТЗ.ДатаОтправления КАК ДатаОтправления
	//-- #4418 смарт: Тимофеева 26.09.2025
	|ПОМЕСТИТЬ ВТ_ТЗДляПересчета
	|ИЗ
	|	ВТ_ТЗ КАК ВТ_ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.смартОписанияДляПретензий КАК смартОписанияДляПретензий
	|		ПО ВТ_ТЗ.Номенклатура = смартОписанияДляПретензий.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ ВТ_КурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &НоваяВалюта) КАК КурсыВалютСрезПоследних
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта,
	|	КурсыВалютСрезПоследних.Курс,
	|	КурсыВалютСрезПоследних.Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(
	|			&Дата,
	|			Валюта В
	|				(ВЫБРАТЬ
	|					ВТ_ТЗДляПересчета.Валюта
	|				ИЗ
	|					ВТ_ТЗДляПересчета)) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЗДляПересчета.НомерСтроки КАК НомерСтроки,
	|	ВТ_ТЗДляПересчета.Номенклатура КАК Номенклатура,
	|	ВТ_ТЗДляПересчета.Количество КАК Количество,
	|	ВТ_ТЗДляПересчета.КодТНВЭД КАК КодТНВЭД,
	|	ВТ_ТЗДляПересчета.ВесНетто КАК ВесНетто,
	|	ВТ_ТЗДляПересчета.Описание КАК Описание,
	|	ВТ_ТЗДляПересчета.НомерЗаявки КАК НомерЗаявки,
	|	ВТ_ТЗДляПересчета.ЗаявкаСсылка КАК ЗаявкаСсылка,
	|	ВТ_ТЗДляПересчета.Цена КАК Цена,
	|	ВТ_ТЗДляПересчета.Валюта КАК Валюта,
	|	ЕСТЬNULL(ВТ_КурсыВалют.Курс, 1) КАК Курс,
	|	ЕСТЬNULL(ВТ_КурсыВалют.Кратность, 1) КАК Кратность,
	|	ЕСТЬNULL(ВТ_КурсыВалютДляПечати.Курс, 1) КАК КурсДляПечати,
	|	ЕСТЬNULL(ВТ_КурсыВалютДляПечати.Кратность, 1) КАК КратностьДляПечати
	//++ #4418 смарт: Тимофеева 26.09.2025 / Обработка Печать Сопроводительных Документов. Доработка.
	|   ,
	|	ВТ_ТЗДляПересчета.НомерОтправления КАК НомерОтправления,
	|	ВТ_ТЗДляПересчета.ДатаОтправления КАК ДатаОтправления
	//-- #4418 смарт: Тимофеева 26.09.2025
	|ИЗ
	|	ВТ_ТЗДляПересчета КАК ВТ_ТЗДляПересчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КурсыВалют КАК ВТ_КурсыВалют
	|		ПО ВТ_ТЗДляПересчета.Валюта = ВТ_КурсыВалют.Валюта
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КурсыВалют КАК ВТ_КурсыВалютДляПечати
	|		ПО (ВТ_КурсыВалютДляПечати.Валюта = &НоваяВалюта)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("ТЗ", 			Объект.ЗапчастиКОтправке.Выгрузить());		
	Запрос.УстановитьПараметр("НоваяВалюта", 	Объект.Валюта);
	Запрос.УстановитьПараметр("Дата", 			Объект.Дата);
	
	Объект.ЗапчастиКОтправке.Очистить();
    Выборка = Запрос.Выполнить().Выбрать();		
	Пока Выборка.Следующий() Цикл		
		НоваяСтрока = Объект.ЗапчастиКОтправке.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если НЕ Объект.Валюта = Выборка.Валюта Тогда
			ПараметрыВалютыДляПечати 	= Новый Структура("Валюта, Курс, Кратность", Объект.Валюта, Выборка.КурсДляПечати, Выборка.КратностьДляПечати);
			ПараметрыВалютыВР  			= Новый Структура("Валюта, Курс, Кратность", Выборка.Валюта, Выборка.Курс,  Выборка.Кратность);
		
			НоваяСтрока.Цена 			= РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(НоваяСтрока.Цена, ПараметрыВалютыВР, ПараметрыВалютыДляПечати);
		КонецЕсли; 
		НоваяСтрока.Сумма 	= НоваяСтрока.Цена * НоваяСтрока.Количество;
	КонецЦикла;	 
	
КонецПроцедуры 

//-- #3978 смарт: Тимофеева 11.08.2025 

#КонецОбласти

#КонецОбласти
